[data]
dataset_dir=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\detector
classes_file=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\detector\classes.txt
weights_file=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\detector\nardenet.weights
backup_dir=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\training_backups\

[net]
width=32
height=32
channels=3
num_classes = 3

[training]
batch_size=3
subbatch_size=1
max_iterations = 10000
learning_rate = 0.0001
lr_policy = steps
step_percents = 0.8, 0.9
step_scaling = 0.1, 0.1
ease_in=500
momentum=0.9
regularization=l2
decay=0.0005
saturation=0.5, 1.5
exposure=0.7, 1.5
hue=0.9, 1.1

[conv]
filters = 64
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[conv]
filters = 64
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[maxpool]
kernel_size = 2
stride = 2

[conv]
filters = 128
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[conv]
filters = 128
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[maxpool]
kernel_size = 2
stride = 2

[conv]
filters = 256
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[conv]
filters = 256
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[maxpool]
kernel_size = 2
stride = 2

[conv]
filters = 512
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[conv]
filters = 512
kernel_size = 3
stride = 1
pad = 1
batch_norm = 1
activation = relu

[maxpool]
kernel_size = 2
stride = 2

[conv]
filters = 512
kernel_size = 1
stride = 1
pad = 0
batch_norm = 1
activation = relu

[conv]
filters = 512
kernel_size = 1
stride = 1
pad = 0
batch_norm = 1
activation = relu

[conv]
filters = 8
kernel_size = 1
stride = 1
pad = 0
batch_norm = 0
activation = sigmoid

[detect]
anchors = .5,.5
