[data]
dataset_dir=D:\TonyDev\NardeNet\data\images\
classes_file=D:\TonyDev\NardeNet\data\classes.txt
weights_file=D:\TonyDev\NardeNet\data\nardenet.weights
backup_dir=D:\TonyDev\NardeNet\data\training_backups\

[net]
width=28
height=28
channels=3
num_classes = 2
cost = mse

[training]
batch_size=1
subbatch_size=1
max_iterations = 10000
learning_rate = 0.001
lr_policy = steps
step_percents = 0.8, 0.9
step_scaling = 0.1, 0.1
ease_in=1000
momentum=0.9
decay=0.0005
saturation=0.5, 1.5
exposure=0.7, 1.5
hue=0.9, 1.1

[conv]
id = 0
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 1
batch_normalize = 1
filters = 16
kernel_size = 3
stride = 1
pad = 1
activation = mish
out_ids = 4, 2

[conv]
id = 2
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 3
batch_normalize = 1
filters = 48
kernel_size = 3
stride = 1
pad = 1
activation = mish
out_ids = 5

[conv]
id = 4
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish
in_ids = 1

[conv]
id = 5
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 6
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish
in_ids = 5, 3

[conv]
id = 7
batch_normalize = 1
filters = 64
kernel_size = 3
stride = 1
activation = mish

[conv]
id = 8
batch_normalize = 1
filters = 128
kernel_size = 3
stride = 1
pad = 1
activation = mish

[classify]
id = 9
activation = sigmoid
cost=mse
