[data]
dataset_dir=D:\TonyDev\NardeNet\data\images\
classes_file=D:\TonyDev\NardeNet\data\classes.txt
weights_file=D:\TonyDev\NardeNet\data\nardenet.weights
backup_dir=D:\TonyDev\NardeNet\data\training_backups\

[net]
width=28
height=28
channels=3
num_classes = 3

[training]
batch_size=2
subbatch_size=1
max_iterations = 10000
learning_rate = 0.0001
lr_policy = steps
step_percents = 0.8, 0.9
step_scaling = 0.1, 0.1
ease_in=1000
momentum=0.9
decay=0.0005
saturation=0.5, 1.5
exposure=0.7, 1.5
hue=0.9, 1.1

[conv]
id = 0
batch_normalize = 1
filters = 50
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 1
batch_normalize = 1
filters = 64
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 2
batch_normalize = 1
filters = 48
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 3
batch_normalize = 1
filters = 64
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 4
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 5
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 6
batch_normalize = 1
filters = 67
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 7
batch_normalize = 1
filters = 45
kernel_size = 3
stride = 1
activation = mish

[conv]
id = 8
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 9
batch_normalize = 1
filters = 100
kernel_size = 3
stride = 1
pad = 1
activation = mish

[conv]
id = 10
batch_normalize = 1
filters = 32
kernel_size = 3
stride = 1
pad = 1
activation = mish

[classify]
id = 11
activation = softmax
loss=cce
