[data]
dataset_dir=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\detector
classes_file=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\detector\classes.txt
weights_file=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\detector\nardenet.weights
backup_dir=C:\Users\TNard\OneDrive\Desktop\dev\Nardenet-main\data\training_backups\

[net]
width=416
height=416
channels=3
num_classes = 3

[training]
batch_size=3
subbatch_size=1
max_iterations = 10000
save_frequency = 1000

learning_rate = 0.1
lr_policy = steps
step_percents = 0.8, 0.9
step_scaling = 0.1, 0.1
ease_in=1000
momentum=0.9

regularization=l2
decay=0.0005

saturation=0.5, 1.5
exposure=0.7, 1.5
hue=0.9, 1.1
aspect=0.75, 1.3


[conv]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[conv]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[conv]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[conv]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[conv]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[conv]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[conv]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[conv]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[conv]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[conv]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[conv]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[conv]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[conv]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[conv]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[conv]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

##################################

[conv]
batch_norm=1
filters=256
kernel_size=1
stride=1
pad=1
activation=leaky

[conv]
batch_norm=1
filters=512
kernel_size=3
stride=1
pad=1
activation=leaky

[conv]
batch_norm=1
filters=512
kernel_size=1
stride=1
pad=1
activation=leaky

[classify]
activation=softmax
loss=cce
