[data]
dataset_dir=D:\TonyDev\NardeNet\data\cifar3\
classes_file=D:\TonyDev\NardeNet\data\cifar3\classes.txt
weights_file=D:\TonyDev\NardeNet\data\nardenet.weights
backup_dir=D:\TonyDev\NardeNet\data\training_backups\

[net]
width=32
height=32
channels=3
num_classes = 3

[training]
batch_size=8
subbatch_size=1
max_iterations = 10000
learning_rate = 0.1
lr_policy = steps
step_percents = 0.8, 0.9
step_scaling = 0.1, 0.1
ease_in=1000
momentum=0.9
regularization=l2
decay=0.0005
saturation=0.5, 1.5
exposure=0.7, 1.5
hue=0.9, 1.1

[conv]
id = 0
batch_norm = 1
filters = 64
kernel_size = 3
stride = 1
pad = 1
activation = leaky

[conv]
id = 1
batch_norm = 1
filters = 64
kernel_size = 3
stride = 1
pad = 1
activation = leaky

[conv]
id = 2
batch_norm = 1
filters = 64
kernel_size = 3
stride = 2
pad = 1
activation = leaky

[conv]
id = 3
batch_norm = 1
filters = 128
kernel_size = 3
stride = 1
pad = 1
activation = leaky

[conv]
id = 4
batch_norm = 1
filters = 128
kernel_size = 3
stride = 1
pad = 1
activation = leaky

[conv]
id = 5
batch_norm = 1
filters = 128
kernel_size = 3
stride = 2
pad = 1
activation = leaky

[conv]
id = 6
batch_norm = 1
filters = 256
kernel_size = 3
stride = 1
pad = 1
activation = leaky

[conv]
id = 7
batch_norm = 1
filters = 256
kernel_size = 3
stride = 1
pad = 1
activation = leaky

[conv]
id = 8
batch_norm = 1
filters = 256
kernel_size = 3
stride = 1
pad = 1
activation = leaky

[conv]
id = 9
batch_norm = 1
filters = 3
kernel_size = 1
stride = 1
pad = 1
activation = leaky

[classify]
id = 10
batch_norm = 0
activation = softmax
loss=cce
